


def string_to_ascii(s):
    mapping = {
        '’': '',
        'â': 'a',
        'á': 'a',
        'ã': 'a',
        'å': 'a',
        'ä': 'a',
        'æ': 'ae',
        'ç': 'c',
        'ć': 'c',
        'č': 'c',
        'é': 'e',
        'è': 'e',
        'ë': 'e',
        'ğ': 'g',
        'ı': 'i',
        'í': 'i',
        'ï': 'i',
        'ñ': 'n',
        'ń': 'n',
        'ő': 'o',
        'ó': 'o',
        'ô': 'o',
        'ö': 'o',
        'ş': 's',
        'š': 's',
        'ú': 'u',
        'ü': 'u',
        'ý': 'y',
        'ż': 'z',
        'ž': 'z',
        }

    s2 = ''
    for char in s.lower():
        s2 += mapping.get(char, char)
    return s2
